%================================================================
% 功能：   机器人建模、仿真
% 参数：   
%          
%        
%          
% 返回值：  
% 主要思路：
% 备注：    
% 调用方法：
% 日期：    2014/8/23 20:37
%================================================================
    
%%%%%%1 设定位姿数目和对应的关节角
numPt=400;%位姿数目
matAng=(rand(numPt,6)-0.5)*2*180/180*pi;%产生numPt行 6列分布在0~1的随机数矩阵
qi_Base=[0 -90 0 180 0 0]/180*pi;
 for i=1:numPt
      matAng(i,:)=qi_Base+matAng(i,:);%关节角度矩阵
 end
 

%%%%%%  2 设定关节连杆参数矩阵Q、和理论的关节误差矩阵dQ
    %alpha         a     theta         d      beta
   Q =  [0         0         0    0.6300         0
   -1.5708    0.6000   -1.5708         0         0
         0    1.2800         0         0         0
   -1.5708    0.2000    3.1416    1.5920         0
   -1.5708         0         0         0         0
    1.5708         0         0    0.2000         0];
    
dQ=[0.0054    0.0036    0.0015    0.0024         0
    0.0010    0.0010    0.0033    0.0023    0.0023
    0.0010    0.0006    0.0010    0.0023    0.0041
    0.0019    0.0018    0.0010    0.0010         0
    0.0051    0.0061    0.0023    0.0010         0
    0.0023    0.0007    0.0010    0.0020         0];

DesQ=Q+dQ;
DesdqR=[dQ(:,2);dQ(:,1);dQ(:,4);dQ(:,3);dQ(:,5)];%转为误差向量


%%%%%%  3  设定numPt/2 组{E}下的球心坐标DesPe
DesPe=[-32.3732, 16.5316, 367.7633]/1000;
% DesPe=(rand(numPt,3)-0.5)*2*1000/1000;%%平移向量
% DesPe(numPt/2+1:numPt,:)=DesPe(1:numPt/2,:);

%%%%%%  4  设定{S-B}位姿的理论值DesTbs
Rpy=[90.7014   -0.0245    6.7696];
tbs=[827.71226936543,1618.51958150736,1533.92214650393]/1000;
DesTbs=[RPY2R(Rpy),tbs';0 0 0 1];

%%%%%%  5  模拟出numPt个机器人的理论位姿和实际位姿
MeaTse=zeros(4,4,numPt);
DesTse=zeros(4,4,numPt);
for i=1:numPt
tmpiQ=[DesQ(:,1:2),matAng(i,:)'+dQ(:,3),DesQ(:,4:5)];
DesTse(:,:,i)=MyFkine(tmpiQ);
MeaTse(:,:,i)=MyFkine([Q(:,1:2),matAng(i,:)',Q(:,4:5)]);
end


%%%%%%%  6  模拟出扫描仪下面的坐标simPs
simPs=zeros(numPt,4);
for i=1:numPt
simPs(i,:)=((DesTbs*DesTse(:,:,i))*([DesPe 1]'))';
end
simPs=simPs(:,1:3); 